docs/artillery-stress.txt
Test run id: t7ybe_kyf9er34568xkbdwqqkzmk9ft45dj_gd85
Phase started: Calentamiento (index: 0, duration: 30s) 03:14:55(-0500)

Phase completed: Calentamiento (index: 0, duration: 30s) 03:15:25(-0500)

Phase started: Carga media (index: 1, duration: 30s) 03:15:25(-0500)

--------------------------------------
Metrics for period to: 03:15:00(-0500) (width: 3.054s)
--------------------------------------

http.codes.200: ................................................................ 8
http.downloaded_bytes: ......................................................... 816
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 8
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 8
vusers.completed: .............................................................. 8
vusers.created: ................................................................ 8
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 8
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 14
  mean: ........................................................................ 6.4
  median: ...................................................................... 4.6
  p95: ......................................................................... 11.4
  p99: ......................................................................... 11.4


--------------------------------------
Metrics for period to: 03:15:10(-0500) (width: 9.054s)
--------------------------------------

http.codes.200: ................................................................ 20
http.downloaded_bytes: ......................................................... 2040
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 20
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.5
  max: ......................................................................... 6
  mean: ........................................................................ 4.4
  median: ...................................................................... 4.3
  p95: ......................................................................... 5.6
  p99: ......................................................................... 5.6


--------------------------------------
Metrics for period to: 03:15:20(-0500) (width: 9.054s)
--------------------------------------

http.codes.200: ................................................................ 20
http.downloaded_bytes: ......................................................... 2040
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 20
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.7
  max: ......................................................................... 5.2
  mean: ........................................................................ 3.8
  median: ...................................................................... 3.7
  p95: ......................................................................... 4.5
  p99: ......................................................................... 4.5


Phase completed: Carga media (index: 1, duration: 30s) 03:15:55(-0500)

Phase started: Carga alta (index: 2, duration: 30s) 03:15:55(-0500)

--------------------------------------
Metrics for period to: 03:15:30(-0500) (width: 9.055s)
--------------------------------------

http.codes.200: ................................................................ 44
http.downloaded_bytes: ......................................................... 4488
http.request_rate: ............................................................. 18/sec
http.requests: ................................................................. 44
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.5
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.5
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 44
vusers.completed: .............................................................. 44
vusers.created: ................................................................ 44
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 44
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 10.1
  mean: ........................................................................ 5
  median: ...................................................................... 3.9
  p95: ......................................................................... 9.7
  p99: ......................................................................... 10.1


--------------------------------------
Metrics for period to: 03:15:40(-0500) (width: 9.958s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 7
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 7
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 9
  mean: ........................................................................ 3.8
  median: ...................................................................... 3.6
  p95: ......................................................................... 5.1
  p99: ......................................................................... 7.6


--------------------------------------
Metrics for period to: 03:15:50(-0500) (width: 9.953s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.5
  max: ......................................................................... 10.1
  mean: ........................................................................ 3.7
  median: ...................................................................... 3.6
  p95: ......................................................................... 5
  p99: ......................................................................... 6.4


Phase completed: Carga alta (index: 2, duration: 30s) 03:16:25(-0500)

Phase started: Estres (index: 3, duration: 30s) 03:16:25(-0500)

--------------------------------------
Metrics for period to: 03:16:00(-0500) (width: 9.955s)
--------------------------------------

http.codes.200: ................................................................ 130
http.downloaded_bytes: ......................................................... 13260
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 130
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 7
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 7
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.responses: ................................................................ 130
vusers.completed: .............................................................. 130
vusers.created: ................................................................ 130
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 130
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 11.9
  mean: ........................................................................ 4.4
  median: ...................................................................... 3.8
  p95: ......................................................................... 10.3
  p99: ......................................................................... 11.4


--------------------------------------
Metrics for period to: 03:16:10(-0500) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 200
http.downloaded_bytes: ......................................................... 20400
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 7.2
  mean: ........................................................................ 3.9
  median: ...................................................................... 3.8
  p95: ......................................................................... 5.5
  p99: ......................................................................... 6.6


--------------------------------------
Metrics for period to: 03:16:20(-0500) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 200
http.downloaded_bytes: ......................................................... 20400
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 6.1
  mean: ........................................................................ 3.5
  median: ...................................................................... 3.4
  p95: ......................................................................... 4.8
  p99: ......................................................................... 5.5


--------------------------------------
Metrics for period to: 03:16:30(-0500) (width: 9.959s)
--------------------------------------

http.codes.200: ................................................................ 222
http.downloaded_bytes: ......................................................... 22644
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 222
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 222
vusers.completed: .............................................................. 222
vusers.created: ................................................................ 222
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 222
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2
  max: ......................................................................... 13.4
  mean: ........................................................................ 3.9
  median: ...................................................................... 3.4
  p95: ......................................................................... 8.2
  p99: ......................................................................... 11.8


--------------------------------------
Metrics for period to: 03:16:40(-0500) (width: 9.959s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 30600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 9
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.1
  max: ......................................................................... 10.9
  mean: ........................................................................ 3.5
  median: ...................................................................... 3.3
  p95: ......................................................................... 5.1
  p99: ......................................................................... 7.6


--------------------------------------
Metrics for period to: 03:16:50(-0500) (width: 9.959s)
--------------------------------------

http.codes.200: ................................................................ 300
http.downloaded_bytes: ......................................................... 30600
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 7.4
  mean: ........................................................................ 3.2
  median: ...................................................................... 3.1
  p95: ......................................................................... 4.3
  p99: ......................................................................... 6.5


Phase completed: Estres (index: 3, duration: 30s) 03:16:55(-0500)

--------------------------------------
Metrics for period to: 03:17:00(-0500) (width: 7.363s)
--------------------------------------

http.codes.200: ................................................................ 216
http.downloaded_bytes: ......................................................... 22032
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 216
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 216
vusers.completed: .............................................................. 216
vusers.created: ................................................................ 216
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 216
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 6.9
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 4.2
  p99: ......................................................................... 5.5


All VUs finished. Total time: 2 minutes, 2 seconds

--------------------------------
Summary report @ 03:16:59(-0500)
--------------------------------

http.codes.200: ................................................................ 1860
http.downloaded_bytes: ......................................................... 189720
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 1860
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 9
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 1860
vusers.completed: .............................................................. 1860
vusers.created: ................................................................ 1860
vusers.created_by_name.Prueba progresiva HAProxy: .............................. 1860
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 14
  mean: ........................................................................ 3.7
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.5
  p99: ......................................................................... 10.5